GopalSaraf/Practicals/PSDL/include/proc/pic16lf1512.inc
// Register: AADCON3
#define AADCON3 AADCON3
AADCON3                                  equ 0714h
// bitfield definitions
AADCON3_ADDSEN_POSN                      equ 0000h
AADCON3_ADDSEN_POSITION                  equ 0000h
AADCON3_ADDSEN_SIZE                      equ 0001h
AADCON3_ADDSEN_LENGTH                    equ 0001h
AADCON3_ADDSEN_MASK                      equ 0001h
AADCON3_ADIPEN_POSN                      equ 0001h
AADCON3_ADIPEN_POSITION                  equ 0001h
AADCON3_ADIPEN_SIZE                      equ 0001h
AADCON3_ADIPEN_LENGTH                    equ 0001h
AADCON3_ADIPEN_MASK                      equ 0002h
AADCON3_ADOOEN_POSN                      equ 0003h
AADCON3_ADOOEN_POSITION                  equ 0003h
AADCON3_ADOOEN_SIZE                      equ 0001h
AADCON3_ADOOEN_LENGTH                    equ 0001h
AADCON3_ADOOEN_MASK                      equ 0008h
AADCON3_ADOEN_POSN                       equ 0004h
AADCON3_ADOEN_POSITION                   equ 0004h
AADCON3_ADOEN_SIZE                       equ 0001h
AADCON3_ADOEN_LENGTH                     equ 0001h
AADCON3_ADOEN_MASK                       equ 0010h
AADCON3_ADOLEN_POSN                      equ 0005h
AADCON3_ADOLEN_POSITION                  equ 0005h
AADCON3_ADOLEN_SIZE                      equ 0001h
AADCON3_ADOLEN_LENGTH                    equ 0001h
AADCON3_ADOLEN_MASK                      equ 0020h
AADCON3_ADIPPOL_POSN                     equ 0006h
AADCON3_ADIPPOL_POSITION                 equ 0006h
AADCON3_ADIPPOL_SIZE                     equ 0001h
AADCON3_ADIPPOL_LENGTH                   equ 0001h
AADCON3_ADIPPOL_MASK                     equ 0040h
AADCON3_ADEPPOL_POSN                     equ 0007h
AADCON3_ADEPPOL_POSITION                 equ 0007h
AADCON3_ADEPPOL_SIZE                     equ 0001h
AADCON3_ADEPPOL_LENGTH                   equ 0001h
AADCON3_ADEPPOL_MASK                     equ 0080h

// Register: AADSTAT
#define AADSTAT AADSTAT
AADSTAT                                  equ 0715h
// bitfield definitions
AADSTAT_ADSTG0_POSN                      equ 0000h
AADSTAT_ADSTG0_POSITION                  equ 0000h
AADSTAT_ADSTG0_SIZE                      equ 0001h
AADSTAT_ADSTG0_LENGTH                    equ 0001h
AADSTAT_ADSTG0_MASK                      equ 0001h
AADSTAT_ADSTG1_POSN                      equ 0001h
AADSTAT_ADSTG1_POSITION                  equ 0001h
AADSTAT_ADSTG1_SIZE                      equ 0001h
AADSTAT_ADSTG1_LENGTH                    equ 0001h
AADSTAT_ADSTG1_MASK                      equ 0002h
AADSTAT_ADCONV_POSN                      equ 0002h
AADSTAT_ADCONV_POSITION                  equ 0002h
AADSTAT_ADCONV_SIZE                      equ 0001h
AADSTAT_ADCONV_LENGTH                    equ 0001h
AADSTAT_ADCONV_MASK                      equ 0004h
AADSTAT_ADSTG_POSN                       equ 0000h
AADSTAT_ADSTG_POSITION                   equ 0000h
AADSTAT_ADSTG_SIZE                       equ 0002h
AADSTAT_ADSTG_LENGTH                     equ 0002h
AADSTAT_ADSTG_MASK                       equ 0003h

// Register: AADPRE
#define AADPRE AADPRE
AADPRE                                   equ 0716h
// bitfield definitions
AADPRE_ADPRE0_POSN                       equ 0000h
AADPRE_ADPRE0_POSITION                   equ 0000h
AADPRE_ADPRE0_SIZE                       equ 0001h
AADPRE_ADPRE0_LENGTH                     equ 0001h
AADPRE_ADPRE0_MASK                       equ 0001h
AADPRE_ADPRE1_POSN                       equ 0001h
AADPRE_ADPRE1_POSITION                   equ 0001h
AADPRE_ADPRE1_SIZE                       equ 0001h
AADPRE_ADPRE1_LENGTH                     equ 0001h
AADPRE_ADPRE1_MASK                       equ 0002h
AADPRE_ADPRE2_POSN                       equ 0002h
AADPRE_ADPRE2_POSITION                   equ 0002h
AADPRE_ADPRE2_SIZE                       equ 0001h
AADPRE_ADPRE2_LENGTH                     equ 0001h
AADPRE_ADPRE2_MASK                       equ 0004h
AADPRE_ADPRE3_POSN                       equ 0003h
AADPRE_ADPRE3_POSITION                   equ 0003h
AADPRE_ADPRE3_SIZE                       equ 0001h
AADPRE_ADPRE3_LENGTH                     equ 0001h
AADPRE_ADPRE3_MASK                       equ 0008h
AADPRE_ADPRE4_POSN                       equ 0004h
AADPRE_ADPRE4_POSITION                   equ 0004h
AADPRE_ADPRE4_SIZE                       equ 0001h
AADPRE_ADPRE4_LENGTH                     equ 0001h
AADPRE_ADPRE4_MASK                       equ 0010h
AADPRE_ADPRE5_POSN                       equ 0005h
AADPRE_ADPRE5_POSITION                   equ 0005h
AADPRE_ADPRE5_SIZE                       equ 0001h
AADPRE_ADPRE5_LENGTH                     equ 0001h
AADPRE_ADPRE5_MASK                       equ 0020h
AADPRE_ADPRE6_POSN                       equ 0006h
AADPRE_ADPRE6_POSITION                   equ 0006h
AADPRE_ADPRE6_SIZE                       equ 0001h
AADPRE_ADPRE6_LENGTH                     equ 0001h
AADPRE_ADPRE6_MASK                       equ 0040h
AADPRE_ADPRE_POSN                        equ 0000h
AADPRE_ADPRE_POSITION                    equ 0000h
AADPRE_ADPRE_SIZE                        equ 0007h
AADPRE_ADPRE_LENGTH                      equ 0007h
AADPRE_ADPRE_MASK                        equ 007Fh

// Register: AADACQ
#define AADACQ AADACQ
AADACQ                                   equ 0717h
// bitfield definitions
AADACQ_ADACQ0_POSN                       equ 0000h
AADACQ_ADACQ0_POSITION                   equ 0000h
AADACQ_ADACQ0_SIZE                       equ 0001h
AADACQ_ADACQ0_LENGTH                     equ 0001h
AADACQ_ADACQ0_MASK                       equ 0001h
AADACQ_ADACQ1_POSN                       equ 0001h
AADACQ_ADACQ1_POSITION                   equ 0001h
AADACQ_ADACQ1_SIZE                       equ 0001h
AADACQ_ADACQ1_LENGTH                     equ 0001h
AADACQ_ADACQ1_MASK                       equ 0002h
AADACQ_ADACQ2_POSN                       equ 0002h
AADACQ_ADACQ2_POSITION                   equ 0002h
AADACQ_ADACQ2_SIZE                       equ 0001h
AADACQ_ADACQ2_LENGTH                     equ 0001h
AADACQ_ADACQ2_MASK                       equ 0004h
AADACQ_ADACQ3_POSN                       equ 0003h
AADACQ_ADACQ3_POSITION                   equ 0003h
AADACQ_ADACQ3_SIZE                       equ 0001h
AADACQ_ADACQ3_LENGTH                     equ 0001h
AADACQ_ADACQ3_MASK                       equ 0008h
AADACQ_ADACQ4_POSN                       equ 0004h
AADACQ_ADACQ4_POSITION                   equ 0004h
AADACQ_ADACQ4_SIZE                       equ 0001h
AADACQ_ADACQ4_LENGTH                     equ 0001h
AADACQ_ADACQ4_MASK                       equ 0010h
AADACQ_ADACQ5_POSN                       equ 0005h
AADACQ_ADACQ5_POSITION                   equ 0005h
AADACQ_ADACQ5_SIZE                       equ 0001h
AADACQ_ADACQ5_LENGTH                     equ 0001h
AADACQ_ADACQ5_MASK                       equ 0020h
AADACQ_ADACQ6_POSN                       equ 0006h
AADACQ_ADACQ6_POSITION                   equ 0006h
AADACQ_ADACQ6_SIZE                       equ 0001h
AADACQ_ADACQ6_LENGTH                     equ 0001h
AADACQ_ADACQ6_MASK                       equ 0040h
AADACQ_ADACQ_POSN                        equ 0000h
AADACQ_ADACQ_POSITION                    equ 0000h
AADACQ_ADACQ_SIZE                        equ 0007h
AADACQ_ADACQ_LENGTH                      equ 0007h
AADACQ_ADACQ_MASK                        equ 007Fh

